In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = pd.read_excel('/content/application_record.xlsx')
d2 = pd.read_excel('/content/credit_record.xlsx')

In [3]:
d1.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474.0,-1134.0,1,0.0,0.0,0,Security staff,2
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110.0,NaN,1,0.0,1.0,1,Sales staff,1
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110.0,-3051.0,1,0.0,1.0,1,Sales staff,1

In [4]:
d1.shape

(438557, 18)

In [5]:
d1.nunique()

ID                     438510
CODE_GENDER                 2
FLAG_OWN_CAR                2
FLAG_OWN_REALTY             2
CNT_CHILDREN               12
AMT_INCOME_TOTAL          866
NAME_INCOME_TYPE            5
NAME_EDUCATION_TYPE         5
NAME_FAMILY_STATUS          5
NAME_HOUSING_TYPE           6
DAYS_BIRTH              16379
DAYS_EMPLOYED            9406
FLAG_MOBIL                  1
FLAG_WORK_PHONE             2
FLAG_PHONE                  2
FLAG_EMAIL                  2
OCCUPATION_TYPE            18
CNT_FAM_MEMBERS            13
dtype: int64

In [6]:
d2.head()

        ID  MONTHS_BALANCE STATUS
0  5001711             0.0      X
1  5001711            -1.0      0
2  5001711            -2.0      0
3  5001711            -3.0      0
4  5001712             0.0      C

In [7]:
d2.shape

(1048575, 3)

In [8]:
fd = d1.merge(d2, on=['ID'], how='inner')

In [9]:
fd.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2,0.0,C
1,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2,-1.0,C
2,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2,-2.0,C
3,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2,-3.0,C
4,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005.0,-4542.0,1,1.0,0.0,0,NaN,2,-4.0,C

In [10]:
fd['STATUS'].replace({"X":1, "C":1, 0:1, 1:0, 2:0, 3:0, 4:0, 5:0}, inplace=True)

In [11]:
fd['STATUS'].value_counts()

1    766140
0     11575
Name: STATUS, dtype: int64

In [12]:
fd.shape

(777715, 20)

In [13]:
fd.describe()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
count,7.777150e+05,777715.000000,7.776830e+05,777374.000000,777527.000000,777715.0,777685.000000,777675.000000,777715.000000,777715.000000,777715.000000,777715.000000
mean,5.078743e+06,0.428082,1.885361e+05,-16124.597801,57750.609596,1.0,0.231827,0.300980,0.091675,2.208837,-19.373564,0.985117
std,4.180442e+04,0.745755,1.016243e+05,4104.631411,136448.410352,0.0,0.421999,0.458685,0.288567,0.907380,14.082208,0.121086
min,5.008804e+06,0.000000,2.700000e+04,-25152.000000,-15713.000000,1.0,0.000000,0.000000,0.000000,1.000000,-60.000000,0.000000
25%,5.044568e+06,0.000000,1.215000e+05,-19452.000000,-3292.000000,1.0,0.000000,0.000000,0.000000,2.000000,-29.000000,1.000000
50%,5.069530e+06,0.000000,1.620000e+05,-15761.000000,-1682.000000,1.0,0.000000,0.000000,0.000000,2.000000,-17.000000,1.000000
75%,5.115551e+06,1.000000,2.250000e+05,-12716.000000,-431.000000,1.0,0.000000,1.000000,0.000000,3.000000,-8.000000,1.000000
max,5.150487e+06,19.000000,1.575000e+06,-7489.000000,365243.000000,1.0,1.000000,1.000000,1.000000,20.000000,0.000000,1.000000

In [14]:
fd.isnull().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR               16
FLAG_OWN_REALTY            51
CNT_CHILDREN                0
AMT_INCOME_TOTAL           32
NAME_INCOME_TYPE           37
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE         107
DAYS_BIRTH                341
DAYS_EMPLOYED             188
FLAG_MOBIL                  0
FLAG_WORK_PHONE            30
FLAG_PHONE                 40
FLAG_EMAIL                  0
OCCUPATION_TYPE        240048
CNT_FAM_MEMBERS             0
MONTHS_BALANCE              0
STATUS                      0
dtype: int64

In [15]:
fd.nunique()

ID                     36457
CODE_GENDER                2
FLAG_OWN_CAR               2
FLAG_OWN_REALTY            2
CNT_CHILDREN               9
AMT_INCOME_TOTAL         265
NAME_INCOME_TYPE           5
NAME_EDUCATION_TYPE        5
NAME_FAMILY_STATUS         5
NAME_HOUSING_TYPE          6
DAYS_BIRTH              7183
DAYS_EMPLOYED           3640
FLAG_MOBIL                 1
FLAG_WORK_PHONE            2
FLAG_PHONE                 2
FLAG_EMAIL                 2
OCCUPATION_TYPE           18
CNT_FAM_MEMBERS           10
MONTHS_BALANCE            61
STATUS                     2
dtype: int64

In [16]:
fd['FLAG_OWN_CAR'].fillna(fd['FLAG_OWN_CAR'].mode()[0], inplace=True)
fd['FLAG_OWN_REALTY'].fillna(fd['FLAG_OWN_REALTY'].mode()[0], inplace=True)
fd['AMT_INCOME_TOTAL'].fillna(fd['AMT_INCOME_TOTAL'].median(), inplace=True)
fd['NAME_INCOME_TYPE'].fillna(fd['NAME_INCOME_TYPE'].mode()[0], inplace=True)
fd['NAME_HOUSING_TYPE'].fillna(fd['NAME_HOUSING_TYPE'].mode()[0], inplace=True)
fd['DAYS_BIRTH'].fillna(fd['DAYS_BIRTH'].median(), inplace=True)
fd['DAYS_EMPLOYED'].fillna(fd['DAYS_EMPLOYED'].median(), inplace=True)
fd['FLAG_WORK_PHONE'].fillna(fd['FLAG_WORK_PHONE'].mode()[0], inplace=True)
fd['FLAG_PHONE'].fillna(fd['FLAG_PHONE'].mode()[0], inplace=True)
fd['OCCUPATION_TYPE'].fillna(fd['OCCUPATION_TYPE'].mode()[0], inplace=True)
fd['FLAG_PHONE'].fillna(fd['FLAG_PHONE'].mode()[0], inplace=True)

In [17]:
fd.isnull().sum()

ID                     0
CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
DAYS_BIRTH             0
DAYS_EMPLOYED          0
FLAG_MOBIL             0
FLAG_WORK_PHONE        0
FLAG_PHONE             0
FLAG_EMAIL             0
OCCUPATION_TYPE        0
CNT_FAM_MEMBERS        0
MONTHS_BALANCE         0
STATUS                 0
dtype: int64

In [18]:
fd.dtypes

ID                       int64
CODE_GENDER             object
FLAG_OWN_CAR            object
FLAG_OWN_REALTY         object
CNT_CHILDREN             int64
AMT_INCOME_TOTAL       float64
NAME_INCOME_TYPE        object
NAME_EDUCATION_TYPE     object
NAME_FAMILY_STATUS      object
NAME_HOUSING_TYPE       object
DAYS_BIRTH             float64
DAYS_EMPLOYED          float64
FLAG_MOBIL               int64
FLAG_WORK_PHONE        float64
FLAG_PHONE             float64
FLAG_EMAIL               int64
OCCUPATION_TYPE         object
CNT_FAM_MEMBERS          int64
MONTHS_BALANCE         float64
STATUS                   int64
dtype: object

In [19]:
fd.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS', 'MONTHS_BALANCE',
       'STATUS'],
      dtype='object')

In [21]:
labels_dict = {}
obj_columns = ['CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE','OCCUPATION_TYPE'] 

for col in obj_columns:
    unique_values = fd[col].unique()
    for i, val in enumerate(unique_values):
        labels_dict[val] = i
    fd[col] = fd[col].apply(lambda x: labels_dict[x])

In [22]:
labels_dict

{'M': 0,
 'F': 1,
 'Y': 0,
 'N': 1,
 'Working': 0,
 'Commercial associate': 1,
 'Pensioner': 2,
 'State servant': 3,
 'Student': 4,
 'Higher education': 0,
 'Secondary / secondary special': 1,
 'Incomplete higher': 2,
 'Lower secondary': 3,
 'Academic degree': 4,
 'Civil marriage': 0,
 'Married': 1,
 'Single / not married': 2,
 'Separated': 3,
 'Widow': 4,
 'Rented apartment': 0,
 'House / apartment': 1,
 'Municipal apartment': 2,
 'With parents': 3,
 'Co-op apartment': 4,
 'Office apartment': 5,
 'Laborers': 0,
 'Security staff': 1,
 'Sales staff': 2,
 'Accountants': 3,
 'Managers': 4,
 'Drivers': 5,
 'Core staff': 6,
 'High skill tech staff': 7,
 'Cleaning staff': 8,
 'Private service staff': 9,
 'Cooking staff': 10,
 'Low-skill Laborers': 11,
 'Medicine staff': 12,
 'Secretaries': 13,
 'Waiters/barmen staff': 14,
 'HR staff': 15,
 'Realty agents': 16,
 'IT staff': 17}

In [23]:
fd.dtypes

ID                       int64
CODE_GENDER              int64
FLAG_OWN_CAR             int64
FLAG_OWN_REALTY          int64
CNT_CHILDREN             int64
AMT_INCOME_TOTAL       float64
NAME_INCOME_TYPE         int64
NAME_EDUCATION_TYPE      int64
NAME_FAMILY_STATUS       int64
NAME_HOUSING_TYPE        int64
DAYS_BIRTH             float64
DAYS_EMPLOYED          float64
FLAG_MOBIL               int64
FLAG_WORK_PHONE        float64
FLAG_PHONE             float64
FLAG_EMAIL               int64
OCCUPATION_TYPE          int64
CNT_FAM_MEMBERS          int64
MONTHS_BALANCE         float64
STATUS                   int64
dtype: object

In [24]:
fd.drop(['ID','FLAG_MOBIL'],axis=1,inplace=True)

In [32]:
train = fd.sample(frac=0.8, random_state=42)
test = fd.drop(train.index)

In [33]:
print(train.shape)
print(test.shape)

(622172, 18)
(155543, 18)

In [35]:
X_train=train.drop(['STATUS'],axis=1)
y_train=train['STATUS']
X_test=test.drop(['STATUS'],axis=1)
y_test=test['STATUS']

In [42]:
X_train = X_train.values
y_train = y_train.values
X_test = X_test.values
y_test = y_test.values

In [43]:
class KNN:
    def __init__(self, k=3):
        self.k = k
    
    def fit(self, X_train, y_train):
        self.X_train = X_train
        self.y_train = y_train
        
    def predict(self, X_test):
        y_pred = []
        for row in X_test:
            dist = np.sqrt(np.sum((row - self.X_train)**2, axis=1))
            idx = np.argsort(dist)[:self.k]
            labels = self.y_train[idx]
            counts = np.bincount(labels)
            y_pred.append(np.argmax(counts))
        return y_pred

In [44]:
def knn(X_train, y_train, X_test, k):
    knn = KNN(k=k)
    knn.fit(X_train, y_train)
    y_pred = knn.predict(X_test)
    return y_pred

In [45]:
def grid_search_knn(X_train, y_train, X_test, y_test, k_values):
    best_k = None
    best_accuracy = 0.0
    for k in k_values:
        y_pred = knn(X_train, y_train, X_test, k=k)
        accuracy = np.mean(y_pred == y_test)
        if accuracy > best_accuracy:
            best_k = k
            best_accuracy = accuracy
    return best_k, best_accuracy

In [46]:
k_values=[3, 5, 7, 9]

In [ ]:
grid_search_knn(X_train, y_train, X_test, y_test,k_values)

In [ ]:
knn = KNN(k=3)
knn.fit(X_train, y_train)
y_pred = knn.predict(X_test)

In [40]:
accuracy = sum(y_pred == y_test)/len(y_test)
print(f"Accuracy: {accuracy:.2f}")

NameError: ignored